[
  {
    "title": "Mistakenly deported man's attorneys demand his return using Trump's own words",
    "published": "Sun, 13 Apr 2025 13:25:57 +0000",
    "content": "<p>Attorneys arguing for the return of a Maryland resident whom the Trump administration <a href=\"https://www.axios.com/2025/04/04/el-salvador-man-deported-mistakenly-judge-order\" target=\"_self\">erroneously deported</a> to El Salvador highlighted in a Saturday court filing <a href=\"https://www.axios.com/politics-policy/donald-trump\" target=\"_blank\">President Trump</a>'s comments that he would \"bring somebody back\" if directed to by the Supreme Court.</p><p><strong>The big picture: </strong>The high court essentially <a href=\"https://www.axios.com/2025/04/10/supreme-court-abrego-garcia-deported-maryland-el-salvador\" target=\"_blank\">ordered the administration</a> to do just that, ruling on Thursday that officials must take steps to facilitate Kilmar Armando Abrego Garcia's return to the United States. </p><hr /><ul><li>The government has accused Abrego Garcia, who was legally living in Maryland with \"withholding from removal\" status, of being a member of <a href=\"https://www.axios.com/2025/04/08/immigration-ice-gangs-deport-decisions\" target=\"_self\">MS-13</a>, even though he has not been convicted of gang-related crimes.</li><li>Abrego Garcia was given \"withholding from removal status\" due to likelihood of harm in his native El Salvador.</li></ul><p><strong>Driving the news: </strong>Trump on Friday <a href=\"https://www.newsnationnow.com/politics/trump-says-he-would-respect-supreme-court-decision-to-return-wrongly-deported-man/\" target=\"_blank\">told</a> reporters that if <strong>\"</strong>the Supreme Court said bring somebody back I would do that.\"</p><ul><li>He added, \"I respect the Supreme Court\"</li></ul><p><strong>Abrego Garcia's lawyers</strong> characterized the president's statement as an acknowledgment that the U.S. \"has the power to facilitate Abrego Garcia's release from prison and return to the United States\" in a Saturday <a href=\"https://www.documentcloud.org/documents/25895908-abrego-garcia_motion/\" target=\"_blank\">motion</a> for additional relief from the judge overseeing the case.</p><ul><li>Despite the president's acknowledgment, the attorneys argued, \"the Department of Justice and other Government agencies continue to resist this Court and the Supreme Court.\"</li><li>They're asking the court to order the government to take specific steps by the end of the day on Monday to comply with the injunction in the case and order expedited discovery of the government's actions to facilitate Abrego Garcia's return.</li><li>They further asked the court to order the administration show cause by Monday morning as to why it should not be held in contempt.</li></ul><p><strong>Yes, but: </strong>In a Saturday Truth Social <a href=\"https://truthsocial.com/%40realDonaldTrump/posts/114327375256344311\" target=\"_blank\">post</a>, the president applauded Salvadorian President <a href=\"https://www.axios.com/2025/02/04/rubio-us-el-salvador-bukele-jail-americans-immigrants\" target=\"_blank\">Nayib Bukele</a> for having \"graciously accepted into his Nation's custody some of the most violent alien enemies of the World.\"</p><ul><li>He added that \"[t]hese barbarians\" are in the \"sole custody of El Salvador, a proud and sovereign Nation, and their future is up to President B and his Government.\"</li><li>Trump confirmed he would meet with Bukele on Monday.</li></ul><p><strong>Zoom out:</strong> Abrego Garcia is \"alive and secure\" in El Salvador's <a href=\"https://www.axios.com/2025/03/24/boasberg-venezuelans-salvadoran-prison\" target=\"_self\">notorious </a>Center for Terrorism Confinement (CECOT) prison, the government confirmed in a Saturday filing to comply with<strong> </strong>U.S. District Judge Paula Xinis' order requiring the administration to <a href=\"https://www.axios.com/2025/04/11/trump-doj-maryland-man-el-salvador-prison\" target=\"_blank\">give daily updates</a> in the case. </p><ul><li>The status update was shared minutes after the 5 p.m. deadline set by the judge, <a href=\"https://www.nbcnews.com/politics/immigration/mistakenly-deported-man-alive-detained-el-salvador-trump-admin-says-rcna201018\" target=\"_blank\">multiple</a> <a href=\"https://abcnews.go.com/Politics/state-department-reveals-status-man-erroneously-deported-el/story?id=120752503\" target=\"_blank\">outlets</a> noted.</li></ul><p><strong>Catch up quick:</strong> The administration turned to the Supreme Court in an effort to block Xinis' <a href=\"https://www.axios.com/2025/04/04/el-salvador-man-deported-mistakenly-judge-order\" target=\"_blank\">previous order</a> to bring Abrego Garcia, who the government admitted was sent to El Salvador in an \"administrative error,\" back to the U.S.</p><ul><li>The Justice Department last week argued that it would be \"impracticable\" to satisfy a court-ordered deadline to share details of how it plans to return the Maryland father hours after the Supreme Court ruled.</li></ul><p><strong>What's next: </strong>Xinis set a Tuesday hearing in the case.</p><p><strong>Go deeper: </strong><a href=\"https://www.axios.com/2025/04/06/deportation-mistake-doj-salvadorian-man\" target=\"_blank\">Judge blasts government over mistakenly deporting Maryland man</a></p>",
    "link": "https://www.axios.com/2025/04/13/trump-maryland-man-deported-el-salvador"
  },
  {
    "title": "Trump redefines fraud in quest to crush \"Deep State\"",
    "published": "Sun, 13 Apr 2025 13:09:29 +0000",
    "content": "<p>Bruised by years of civil suits, criminal charges and a historic felony fraud conviction, <a href=\"https://www.axios.com/politics-policy/donald-trump\" target=\"_blank\">President Trump</a> is using his second term to delegitimize the very concept of <a href=\"https://www.axios.com/2025/03/31/trump-pardons-bitmex-crypto-fraud\" target=\"_blank\">white-collar crime</a>.</p><p><strong>Why it matters: </strong>Trump's belief that he was a victim of \"lawfare\" has tainted his view of the justice system. Paired with his crusade to crush the \"Deep State\" regulatory complex, Trump could enable a golden age of financial fraud, <a href=\"https://www.citizen.org/article/corporate-clemency-trump-enforcement-report/\" target=\"_blank\">ethics watchdogs fear</a>.</p><hr /><p><strong>The big picture: </strong>At an institutional level, Trump's administration has moved swiftly in its first 80 days to narrow the government's mandate for enforcing fraud.</p><ul><li>In early February, Trump and Elon Musk's DOGE team effectively shut down the <a href=\"https://www.axios.com/2025/02/10/doge-trump-cfpb-scammers\" target=\"_blank\">Consumer Financial Protection Bureau</a>, the post-recession agency created to protect Americans from predatory financial practices.</li><li>Trump then paused enforcement of the <a href=\"https://www.axios.com/2025/02/12/trump-foreign-corrupt-practices-act\" target=\"_blank\">Foreign Corrupt Practices Act</a>, claiming the 1977 anti-bribery statute had been \"stretched beyond proper bounds\" and was hurting U.S. companies' ability to compete overseas.</li><li>In March, Trump <a href=\"https://www.axios.com/2025/03/18/trump-fires-democratic-ftc-commissioners\" target=\"_blank\">fired two Democrats</a> from the Federal Trade Commission, taking aim at one of the government's top watchdogs for corporate fraud, consumer deception and antitrust violations.</li></ul><p><strong>By the numbers: </strong>The administration has paused, dropped or withdrawn enforcement actions against at least 100 corporations accused of misconduct, according to the progressive <a href=\"https://www.citizen.org/article/corporate-enforcement-trump-tracker/\" target=\"_blank\">watchdog group Public Citizen</a>.</p><p><strong>Zoom in: </strong>On an individual level, Trump has used his clemency powers and influence to rehabilitate disgraced businessmen and politicians — turning fraud convictions and indictments into badges of loyalty.</p><ul><li><strong>Eric Adams: </strong>The Justice Department <a href=\"https://www.axios.com/2025/04/02/eric-adams-case-dismissed-judge\" target=\"_blank\">dropped its corruption charges</a> against the New York City mayor, claiming the case would interfere with his ability to cooperate with Trump's deportation agenda.</li><li><strong>Trevor Milton: </strong>Trump <a href=\"https://www.axios.com/local/salt-lake-city/2025/04/01/trump-pardon-nikola-trevor-milton-utah-fraud\" target=\"_blank\">issued a full pardon</a> to the Nikola electric vehicle founder, who was convicted of defrauding investors and later donated $1.8 million to help Trump's campaign.</li><li><strong>Carlos Watson: </strong>Trump <a href=\"https://www.axios.com/2025/03/28/trump-ozy-media-carlos-watson-commute\" target=\"_blank\">commuted</a> the Ozy Media founder's nearly 10-year prison sentence, which he was set to begin after his conviction for deceiving investors about his company's financials.</li><li><strong>Bitmex: </strong>The three co-founders and a former employee of the crypto exchange <a href=\"https://www.reuters.com/world/us/trump-pardoned-bitmex-co-founders-white-house-official-says-2025-03-28/\" target=\"_blank\">were granted pardons</a> after pleading guilty to violating the Bank Secrecy Act.</li><li><strong>Devon Archer and Jason Galanis: </strong>The <a href=\"https://apnews.com/article/hunter-biden-trump-business-partner-pardon-5289ca2b9ba6ce7cc4a7dffb0d706088\" target=\"_blank\">two former Hunter Biden associates</a> — who were convicted of defrauding a Native American tribe — received clemency after <a href=\"https://apnews.com/article/hunter-biden-trump-business-partner-pardon-5289ca2b9ba6ce7cc4a7dffb0d706088\" target=\"_blank\">cooperating in GOP investigations</a> into the former president's son.</li><li><strong>Rod Blagojevich: </strong>After commuting his sentence in 2020, Trump <a href=\"https://www.npr.org/2025/02/10/g-s1-47817/trump-pardon-rod-blagojevich-illinois-corruption\" target=\"_blank\">granted a full pardon</a> to the former Illinois governor, who was convicted of trying to sell Barack Obama's former Senate seat.</li></ul><p><strong>Between the lines: </strong>The crypto industry, where Trump's family has deep financial interests, has benefitted enormously from the president's vow to end the regulatory \"war\" waged by the Biden administration.</p><ul><li>The Justice Department this week <a href=\"https://www.washingtonpost.com/national-security/2025/04/08/trump-crypto-fraud-doj-enforcement/\" target=\"_blank\">disbanded its National Cryptocurrency Enforcement Team</a> and accused the Biden administration of \"a reckless strategy of regulation by prosecution.\"</li><li>Justin Sun, a Chinese crypto mogul who was charged by the SEC with fraud and market manipulation, <a href=\"https://www.cnn.com/2025/02/28/business/crypto-mogul-trump-coins-civil-fraud-charges/index.html\" target=\"_blank\">had his case paused</a> after buying $75 million worth of tokens tied to a Trump-backed crypto venture.</li><li>Democrats have <a href=\"https://apnews.com/article/trump-meme-coin-liccardo-crypto-1ecccef627173b01927f03d9b526b7a7\" target=\"_blank\">expressed outrage</a> over Trump's release of his own meme coin, which initially soared in value — then plummeted, wiping away gains for hundreds of thousands of people who invested.</li></ul><p><strong>What they're saying: </strong>\"President Trump will always stand for law and order, ending the weaponization of the legal system, and rooting out fraud in the federal government,\" White House spokesperson Harrison Fields said.</p><ul><li>\"Every action he has taken in his second term reflects these priorities and is authorized by the Constitution,\" Fields added. \"Ethics watchdogs that ignored the previous administration's egregious legal abuses against President Trump have no credibility today.\"</li></ul><p><strong>The bottom line: </strong>For Trump, the concept of \"fraud\" has become less a legal violation than a political label — one he applies freely to his enemies and erases for his allies.</p><ul><li>As part of Elon Musk's campaign to cut government spending, he and Trump <a href=\"https://www.foxnews.com/politics/elon-musk-scraps-chuck-schumer-suggesting-senator-profits-from-government-fraud\" target=\"_blank\">repeatedly have claimed</a>, without evidence, that Democrats are profiting from the alleged \"fraud\" uncovered by DOGE.</li><li>For years, Trump also has insisted, again without evidence, that voter fraud is rampant. This week he <a href=\"https://www.axios.com/2025/04/09/chris-krebs-miles-taylor-doj-investigation-trump\" target=\"_blank\">ordered an investigation</a> into former U.S. cybersecurity chief Chris Krebs for stating the 2020 election was secure.</li><li>\"He's the fraud.\" Trump declared. \"He's a disgrace.\"</li></ul>",
    "link": "https://www.axios.com/2025/04/13/trump-redefines-fraud-corruption"
  },
  {
    "title": "Social Security is now an immigration enforcement tool",
    "published": "Sun, 13 Apr 2025 11:53:57 +0000",
    "content": "<p>The agency responsible for managing the country's retirement system is now in the immigration enforcement business.</p><p><strong>Why it matters: </strong>President Trump's aggressive deportation push is fast becoming a whole-of-government campaign.</p><hr /><p><strong>Driving the news: </strong>There are hundreds of thousands of immigrants in the U.S. with \"temporary parole\" status<strong> —</strong> granted through various Biden-era programs. They received Social Security numbers in order to work.</p><ul><li>A White House official tells Axios the Department of Homeland Security identified more than 6,300 of these folks who, they say, are on the FBI terrorist watch list, or with FBI criminal records.  </li><li>The Social Security agency moved their names into its \"Death Master File,\" a database of dead people. They have since renamed the file the \"Ineligible Master File.\"</li></ul><p><strong>Zoom in: </strong>Inside the Social Security Administration, officials worry that people will be mistakenly added to the list, upending their lives. </p><ul><li>\"Some agency staff have since checked the names and Social Security numbers of some of the youngest immigrants against data the agency typically uses to search for criminal history and found no evidence of crimes or law enforcement interactions,\" staffers told <a href=\"https://www.washingtonpost.com/politics/2025/04/12/trump-immigrants-dead-social-security/\" target=\"_blank\">WashPost.</a></li></ul><p><strong>Between the lines:</strong>  Getting on this list by mistake can wreak havoc on someone's life — employers, landlords, credit agencies, and insurers all check it.</p><ul><li>Americans who've been accidentally declared dead have lost health insurance coverage.</li><li>The idea is to force people out of the country. \"President Trump promised mass deportations,\" says spokeswoman Liz Huston. \"And by removing the monetary incentive for illegal aliens to come and stay, we will encourage them to self-deport.\"</li></ul><p><strong>Getting off the list</strong> isn't easy. \"There's a whole 'I'm not dead' routine that goes to the agency's processing centers,\" Marcela Escobar-Alava, the agency's former chief information officer, told Axios earlier this month.</p><ul><li>The centers are backlogged, and recent staffing cuts will likely make that worse, she says.</li></ul><p><strong>Catch up quick: </strong>Social Security isn't the only non-immigration agency now involved in the immigration crackdown. </p><ul><li>The Internal Revenue Service reached an <a href=\"https://embed.documentcloud.org/documents/25889274-mou-0408/?embed=1\" target=\"_blank\">agreement</a> last Monday with the Department of Homeland Security to share the tax information of <a href=\"https://www.axios.com/2025/04/08/irs-share-immigrant-data-ice-deportations\" target=\"_blank\">undocumented immigrants</a> with immigration authorities.  </li></ul><p><strong>Zoom out:</strong> The President has vowed not to cut Social Security benefits. Instead, the White House argues its plan is to <em>increase</em> benefits by eliminating income taxes on cash benefits, a boost to retirees checks. </p><ul><li>The White House official also said the agency is developing \"AI-powered tools to handle simple tasks like password changes and benefit notifications.\" That would free-up more staff to work on more complex cases, they said.</li></ul><p><strong>Yes, but: </strong>In February, the agency announced it would cut 7,000 employees. Many top career officials with decades of experience have left; more took  \"deferred resignation\" offers, while others are being reassigned into new roles. </p><ul><li>Some of these folks might not be qualified to carry those roles out, worries one current employee who's been with the agency for nearly a decade,</li><li>\"It's not even like walking on eggshells,\" said this staffer, who asked for anonymity fearing retaliation. \"It's more like walking on broken glass.\" </li></ul>",
    "link": "https://www.axios.com/2025/04/13/social-security-immigration"
  }
]